In [1]:
import pandas as pd
import numpy as np
import os

In [7]:
os.chdir('/Users/james/Documents/GitHub/Doit_Python/Data')
os.getcwd()

'/Users/james/Documents/GitHub/Doit_Python/Data'

### p.173 - 혼자서 해보기

In [8]:
mpg_raw = pd.read_csv('mpg.csv')
mpg = mpg_raw.copy()
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl category
0         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
1         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
2         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
3         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
4         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [10]:
mpg['fl'].value_counts()

r    168
p     52
e      8
d      5
c      1
Name: fl, dtype: int64

In [12]:
fuel = pd.DataFrame({'fl'       : ['c','d','e','p','r'],
                     'price_fl' : [2.35, 2.38, 2.11, 2.76, 2.22]})
fuel

  fl  price_fl
0  c      2.35
1  d      2.38
2  e      2.11
3  p      2.76
4  r      2.22

In [14]:
# Q1
mpg_fl = pd.merge(mpg, fuel, how = 'left', on = 'fl')
mpg_fl.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,price_fl
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,2.76
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,2.76
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,2.76
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,2.76
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,2.76

In [18]:
# Q2
mpg_fl[['model', 'fl', 'price_fl']].head()

  model fl  price_fl
0    a4  p      2.76
1    a4  p      2.76
2    a4  p      2.76
3    a4  p      2.76
4    a4  p      2.76

### p.176 - 분석 도전

In [19]:
midwest_raw = pd.read_csv('midwest.csv')
midwest = midwest_raw.copy()
midwest.head()

,PID,county,state,area,poptotal,popdensity,popwhite,popblack,popamerindian,popasian,...,percollege,percprof,poppovertyknown,percpovertyknown,percbelowpoverty,percchildbelowpovert,percadultpoverty,percelderlypoverty,inmetro,category
0,561,ADAMS,IL,0.052,66090,1270.961540,63917,1702,98,249,...,19.631392,4.355859,63628,96.274777,13.151443,18.011717,11.009776,12.443812,0,AAR
1,562,ALEXANDER,IL,0.014,10626,759.000000,7054,3496,19,48,...,11.243308,2.870315,10529,99.087145,32.244278,45.826514,27.385647,25.228976,0,LHR
2,563,BOND,IL,0.022,14991,681.409091,14477,429,35,16,...,17.033819,4.488572,14235,94.956974,12.068844,14.036061,10.852090,12.697410,0,AAR
3,564,BOONE,IL,0.017,30806,1812.117650,29344,127,46,150,...,17.278954,4.197800,30337,98.477569,7.209019,11.179536,5.536013,6.217047,1,ALU
4,565,BROWN,IL,0.018,5836,324.222222,5264,547,14,5,...,14.475999,3.367680,4815,82.505140,13.520249,13.022889,11.143211,19.200000,0,AAR

In [20]:
midwest.shape

(437, 28)

In [21]:
midwest.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 437 entries, 0 to 436
Data columns (total 28 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   PID                   437 non-null    int64
 1   county                437 non-null    object
 2   state                 437 non-null    object
 3   area                  437 non-null    float64
 4   poptotal              437 non-null    int64
 5   popdensity            437 non-null    float64
 6   popwhite              437 non-null    int64
 7   popblack              437 non-null    int64
 8   popamerindian         437 non-null    int64
 9   popasian              437 non-null    int64
 10  popother              437 non-null    int64
 11  percwhite             437 non-null    float64
 12  percblack             437 non-null    float64
 13  percamerindan         437 non-null    float64
 14  percasian             437 non-null    float64
 15  percother             437 non-null    float64
 16  popadults             437 non-null    int64
 17  perchsd               437 non-null    float64
 18  percollege            437 non-null    float64
 19  percprof              437 non-null    float64
 20  poppovertyknown       437 non-null    int64
 21  percpovertyknown      437 non-null    float64
 22  percbelowpoverty      437 non-null    float64
 23  percchildbelowpovert  437 non-null    float64
 24  percadultpoverty      437 non-null    float64
 25  percelderlypoverty    437 non-null    float64
 26  inmetro               437 non-null    int64
 27  category              437 non-null    object
dtypes: float64(15), int64(10), object(3)
memory usage: 95.7+ KB

In [22]:
midwest.describe()

,PID,area,poptotal,popdensity,popwhite,popblack,popamerindian,popasian,popother,percwhite,...,perchsd,percollege,percprof,poppovertyknown,percpovertyknown,percbelowpoverty,percchildbelowpovert,percadultpoverty,percelderlypoverty,inmetro
count,437.000000,437.000000,4.370000e+02,437.000000,4.370000e+02,4.370000e+02,437.000000,437.000000,437.000000,437.000000,...,437.000000,437.000000,437.000000,4.370000e+02,437.000000,437.000000,437.000000,437.000000,437.000000,437.000000
mean,1437.338673,0.033169,9.613030e+04,3097.742985,8.183992e+04,1.102388e+04,343.109840,1310.464531,1612.931350,95.558441,...,73.965546,18.272736,4.447259,9.364228e+04,97.110267,12.510505,16.447464,10.918798,11.389043,0.343249
std,876.390266,0.014679,2.981705e+05,7664.751786,2.001966e+05,7.895827e+04,868.926751,9518.394189,18526.540699,7.087358,...,5.843177,6.261908,2.408427,2.932351e+05,2.749863,5.150155,7.228634,5.109166,3.661259,0.475338
min,561.000000,0.005000,1.701000e+03,85.050000,4.160000e+02,0.000000e+00,4.000000,0.000000,0.000000,10.694087,...,46.912261,7.336108,0.520291,1.696000e+03,80.902441,2.180168,1.918955,1.938504,3.547067,0.000000
25%,670.000000,0.024000,1.884000e+04,622.407407,1.863000e+04,2.900000e+01,44.000000,35.000000,20.000000,94.886032,...,71.325329,14.113725,2.997957,1.836400e+04,96.894572,9.198715,11.624088,7.668009,8.911763,0.000000
50%,1221.000000,0.030000,3.532400e+04,1156.208330,3.447100e+04,2.010000e+02,94.000000,102.000000,66.000000,98.032742,...,74.246891,16.797562,3.814239,3.378800e+04,98.169562,11.822313,15.270164,10.007610,10.869119,0.000000
75%,2059.000000,0.038000,7.565100e+04,2330.000000,7.296800e+04,1.291000e+03,288.000000,401.000000,345.000000,99.074935,...,77.195345,20.549893,4.949324,7.284000e+04,98.598636,15.133226,20.351878,13.182182,13.412162,1.000000
max,3052.000000,0.110000,5.105067e+06,88018.396600,3.204947e+06,1.317147e+06,10289.000000,188565.000000,384119.000000,99.822821,...,88.898674,48.078510,20.791321,5.023523e+06,99.860384,48.691099,64.308477,43.312464,31.161972,1.000000

In [36]:
# Q1
midwest_new = midwest.assign(popkids    = lambda x: x['poptotal'] - x['popadults'],
                             ratio_kids = lambda x: x['popkids'] / x['poptotal'] * 100)
midwest_new[['poptotal', 'popadults', 'popkids', 'ratio_kids']].head()

   poptotal  popadults  popkids  ratio_kids
0     66090      43298    22792   34.486307
1     10626       6724     3902   36.721250
2     14991       9669     5322   35.501301
3     30806      19272    11534   37.440758
4      5836       3979     1857   31.819740

In [48]:
# Q2
midwest_new.sort_values('ratio_kids', ascending = False).head()[['county', 'ratio_kids']]

        county  ratio_kids
230   ISABELLA   51.501172
404  MENOMINEE   50.591260
281     ATHENS   49.320727
247    MECOSTA   49.059183
154     MONROE   47.358182

In [43]:
# Q3
midwest_new.assign(grade = np.where(midwest_new['ratio_kids'] >= 40, 'large',
                           np.where(midwest_new['ratio_kids'] >= 30, 'middle', 'small'))) \
           .groupby('grade') \
           .agg(n_county = ('county', 'count'))

        n_county
grade
large         32
middle       396
small          9

In [46]:
# Q3
midwest_new.assign(grade = np.where(midwest_new['ratio_kids'] >= 40, 'large',
                           np.where(midwest_new['ratio_kids'] >= 30, 'middle', 'small'))) \
           .value_counts('grade') \
           .sort_index()

grade
large      32
middle    396
small       9
dtype: int64

In [49]:
# Q4
midwest.assign(ratio_asian = lambda x: x['popasian'] / x['poptotal'] * 100) \
       .sort_values('ratio_asian') \
       .head(10)[['state', 'county', 'ratio_asian']]

    state     county  ratio_asian
404    WI  MENOMINEE     0.000000
105    IN     BENTON     0.010592
109    IN    CARROLL     0.015950
358    OH     VINTON     0.027032
390    WI       IRON     0.032504
85     IL      SCOTT     0.053154
112    IN       CLAY     0.060716
261    MI     OSCODA     0.063759
340    OH      PERRY     0.066546
73     IL      PIATT     0.070749

# 07. 데이터 정제 - 빠진 데이터, 이상한 데이터 제거하기
## 07-1. 빠진 데이터를 찾아라! - 결측치 정제하기

In [51]:
df = pd.DataFrame({'sex'   : ['M', 'F', np.nan, 'M', 'F'],
                   'score' : [5, 4, 3, 4, np.nan]})
df

   sex  score
0    M    5.0
1    F    4.0
2  NaN    3.0
3    M    4.0
4    F    NaN

In [52]:
df['score'] + 1

0    6.0
1    5.0
2    4.0
3    5.0
4    NaN
Name: score, dtype: float64

In [55]:
pd.isna(df)

     sex  score
0  False  False
1  False  False
2   True  False
3  False  False
4  False   True

In [57]:
pd.isna(df).sum()

sex      1
score    1
dtype: int64

In [58]:
df.dropna(subset = ['score'])

   sex  score
0    M    5.0
1    F    4.0
2  NaN    3.0
3    M    4.0

In [65]:
df_nomiss = df.dropna(subset = ['score'])
df_nomiss['score'] + 1

0    6.0
1    5.0
2    4.0
3    5.0
Name: score, dtype: float64

In [66]:
pd.isna(df_nomiss).sum()

sex      1
score    0
dtype: int64

In [67]:
df_nomiss2 = df.dropna(subset = ['sex', 'score'])
df_nomiss2

  sex  score
0   M    5.0
1   F    4.0
3   M    4.0

In [69]:
pd.isna(df_nomiss2).sum()

sex      0
score    0
dtype: int64

In [72]:
# 아래처럼 결측치를 한 번에 제거하는 방법은 분석에 필요한 행까지 손실되는 단점이 있어 비추함
# 따라서, 위와 같이 결측치를 제거하고자 하는 열을 지정해서 열거하는 방법을 권장함
# 비추
df_nomiss3 = df.dropna()
df_nomiss3

  sex  score
0   M    5.0
1   F    4.0
3   M    4.0

In [73]:
pd.isna(df_nomiss3).sum()

sex      0
score    0
dtype: int64

In [80]:
# 아래의 수치 연산 함수들은 결측치가 있으면 자동으로 제거하고 연산을 수행함
# 이 경우. 데이터에 결측치가 있는 지 모른채 분석하는 우를 범하게 됨
# 따라서, 데이터의 특징을 잘 이해하고 분석하기 위해서는 df.dropna(subset = ['...'])을 이용해 명시적으로 제거하는 방법을 권장함

In [77]:
# 비추
df['score'].mean()

4.0

In [78]:
# 비추
df['score'].sum()

16.0

In [79]:
# 비추
df.groupby('sex').agg(mean_score = ('score', 'mean'),
                      sum_score  = ('score', 'sum'))

     mean_score  sum_score
sex
F           4.0        4.0
M           4.5        9.0

### 평균값으로 결측치 대체하기

In [81]:
exam_raw = pd.read_csv('exam.csv')
exam = exam_raw.copy()
exam.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

In [91]:
exam.loc[[2, 7, 14], ['math']] = np.nan
pd.isna(exam).sum()

id         0
nclass     0
math       3
english    0
science    0
dtype: int64

In [92]:
exam['math'].isna().sum()

3

In [93]:
exam['math'].mean()

55.23529411764706

In [94]:
exam['math'] = exam['math'].fillna(exam['math'].mean())
pd.isna(exam).sum()

id         0
nclass     0
math       0
english    0
science    0
dtype: int64

In [95]:
exam['math'].isna().sum()

0

### p.185 - 혼자서 해보기

In [96]:
mpg = mpg_raw.copy()
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl category
0         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
1         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
2         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
3         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
4         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [98]:
mpg.loc[[64, 123, 130, 152, 211], 'hwy'] = np.nan
mpg['hwy'].isna().sum()

5

In [101]:
# Q1
pd.isna(mpg).sum()

manufacturer    0
model           0
displ           0
year            0
cyl             0
trans           0
drv             0
cty             0
hwy             5
fl              0
category        0
dtype: int64

In [102]:
mpg[['drv', 'hwy']].isna().sum()

drv    0
hwy    5
dtype: int64

In [103]:
# Q2
mpg.dropna(subset = ['hwy']) \
   .groupby('drv') \
   .agg(mean_hwy = ('hwy', 'mean'))

      mean_hwy
drv
4    19.242424
f    28.200000
r    21.000000